zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32f7.h
#define STM32F7_PINMUX_FUNC_PE14_PWM1_CH4 \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PE14_LTDC_CLK \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PE14_FMC_D11	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PE15_LTDC_R7 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PE15_FMC_D12	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

/* Port F */
#define STM32F7_PINMUX_FUNC_PF0_I2C2_SDA   \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32F7_PINMUX_FUNC_PF0_FMC_A0	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF1_I2C2_SCL   \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32F7_PINMUX_FUNC_PF1_FMC_A1	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF2_FMC_A2	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF3_ADC3_IN9	\
	STM32_MODER_ANALOG_MODE
#define STM32F7_PINMUX_FUNC_PF3_FMC_A3	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF4_ADC3_IN14	\
	STM32_MODER_ANALOG_MODE
#define STM32F7_PINMUX_FUNC_PF4_FMC_A4	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF5_ADC3_IN15	\
	STM32_MODER_ANALOG_MODE
#define STM32F7_PINMUX_FUNC_PF5_FMC_A5	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF6_PWM10_CH1 \
	(STM32_PINMUX_ALT_FUNC_3 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF6_UART7_RX    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PF6_ADC3_IN4	\
	STM32_MODER_ANALOG_MODE

#define STM32F7_PINMUX_FUNC_PF7_PWM11_CH1 \
	(STM32_PINMUX_ALT_FUNC_3 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF7_UART7_TX    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF7_ADC3_IN5	\
	STM32_MODER_ANALOG_MODE

#define STM32F7_PINMUX_FUNC_PF8_UART7_RTS    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF8_PWM13_CH1 \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF8_ADC3_IN6	\
	STM32_MODER_ANALOG_MODE

#define STM32F7_PINMUX_FUNC_PF9_UART7_CTS    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF9_PWM14_CH1 \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PF9_ADC3_IN7	\
	STM32_MODER_ANALOG_MODE

#define STM32F7_PINMUX_FUNC_PF10_ADC3_IN8	\
	STM32_MODER_ANALOG_MODE

#define STM32F7_PINMUX_FUNC_PF10_LTDC_DE \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PF11_FMC_SDNRAS	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF12_FMC_A6	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF13_FMC_A7	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF14_FMC_A8	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PF15_FMC_A9	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

/* Port G */
#define STM32F7_PINMUX_FUNC_PG0_FMC_A10	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PG1_FMC_A11	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PG4_FMC_A14	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PG5_FMC_A15	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PG6_LTDC_R7 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG7_LTDC_CLK \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG8_USART6_RTS   \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PG8_FMC_SDCLK	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

#define STM32F7_PINMUX_FUNC_PG9_USART6_RX   \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG10_LTDC_G3 \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PG10_LTDC_B2 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG11_ETH        \
	(STM32_PINMUX_ALT_FUNC_11 | STM32_PUSHPULL_NOPULL | \
	 STM32_OSPEEDR_VERY_HIGH_SPEED)
#define STM32F7_PINMUX_FUNC_PG11_LTDC_B3 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG12_USART6_RTS  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PG12_LTDC_B4 \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PG12_LTDC_B1 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG13_USART6_CTS  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PG13_ETH        \
	(STM32_PINMUX_ALT_FUNC_11 | STM32_PUSHPULL_NOPULL | \
	 STM32_OSPEEDR_VERY_HIGH_SPEED)
#define STM32F7_PINMUX_FUNC_PG13_LTDC_R0 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG14_USART6_TX  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PG14_ETH        \
	(STM32_PINMUX_ALT_FUNC_11 | STM32_PUSHPULL_NOPULL | \
	 STM32_OSPEEDR_VERY_HIGH_SPEED)
#define STM32F7_PINMUX_FUNC_PG14_LTDC_B0 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PG15_USART6_CTS  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32F7_PINMUX_FUNC_PG15_FMC_SDNCAS	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

/* Port H */
#define STM32F7_PINMUX_FUNC_PH2_LTDC_R0 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)

#define STM32F7_PINMUX_FUNC_PH3_LTDC_R1 \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_PUSHPULL_NOPULL)
#define STM32F7_PINMUX_FUNC_PH3_FMC_SDNE0	\
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_PULL_UP | \
	 STM32_OSPEEDR_HIGH_SPEED)

